#### Terraform Plan Output
   ```
   data.terraform_remote_state.fabric: Reading...
data.terraform_remote_state.fabric: Read complete after 1s
module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_C"]: Refreshing state... [id=kfzn0ghYw4qBg58oUEY]
module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_A"]: Refreshing state... [id=PqOzEbLBccaXOBn-Yp0]
module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_B"]: Refreshing state... [id=cw69bBBZx81vVSHSpvs]
module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_D"]: Refreshing state... [id=SPRJHQKCC5WCXI7pT2g]
module.vpn_routing.apstra_datacenter_connectivity_template.vpn: Refreshing state... [id=5a3380c0-45a6-11ee-b94d-617073747261]
null_resource.force_redeploy: Refreshing state... [id=8090725663438332196]
apstra_blueprint_deployment.dc_1: Refreshing state...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # apstra_blueprint_deployment.dc_1 will be created
  + resource "apstra_blueprint_deployment" "dc_1" {
      + blueprint_id            = "2cd5f36b-cc9e-4665-9311-7b252f7deca3"
      + comment                 = "$COMMENT Terraform {{.TerraformVersion}}, provider {{.ProviderVersion}}"
      + has_uncommitted_changes = (known after apply)
      + revision_active         = (known after apply)
      + revision_staged         = (known after apply)
    }

  # null_resource.force_redeploy must be replaced
-/+ resource "null_resource" "force_redeploy" {
      ~ id       = "8090725663438332196" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "fabric_staging_revision" = "31" -> (known after apply)
        }
    }

  # module.vpn_routing.data.apstra_blueprint_deployment.dc_1 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "apstra_blueprint_deployment" "dc_1" {
      + blueprint_id            = "2cd5f36b-cc9e-4665-9311-7b252f7deca3"
      + comment                 = (known after apply)
      + has_uncommitted_changes = (known after apply)
      + revision_active         = (known after apply)
      + revision_staged         = (known after apply)
    }

  # module.vpn_routing.data.apstra_datacenter_ct_bgp_peering_ip_endpoint.vpn will be read during apply
  # (config refers to values not yet known)
 <= data "apstra_datacenter_ct_bgp_peering_ip_endpoint" "vpn" {
      + child_primitives = [
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ]
      + ipv4_address     = "192.168.5.5"
      + name             = "BGP peering with VPN router"
      + primitive        = (known after apply)
    }

  # module.vpn_routing.data.apstra_datacenter_ct_ip_link.vpn will be read during apply
  # (config refers to values not yet known)
 <= data "apstra_datacenter_ct_ip_link" "vpn" {
      + child_primitives     = [
          + (known after apply),
        ]
      + ipv4_addressing_type = "numbered"
      + name                 = "IP handoff to VPN router"
      + primitive            = (known after apply)
      + routing_zone_id      = "Snzd_r3pozEUIM5Ktlo"
    }

  # module.vpn_routing.data.apstra_datacenter_ct_routing_policy.vpn["Vendor_A"] will be read during apply
  # (config refers to values not yet known)
 <= data "apstra_datacenter_ct_routing_policy" "vpn" {
      + name              = "Vendor_A"
      + primitive         = (known after apply)
      + routing_policy_id = (known after apply)
    }

  # module.vpn_routing.data.apstra_datacenter_ct_routing_policy.vpn["Vendor_B"] will be read during apply
  # (config refers to values not yet known)
 <= data "apstra_datacenter_ct_routing_policy" "vpn" {
      + name              = "Vendor_B"
      + primitive         = (known after apply)
      + routing_policy_id = (known after apply)
    }

  # module.vpn_routing.data.apstra_datacenter_ct_routing_policy.vpn["Vendor_C"] will be read during apply
  # (config refers to values not yet known)
 <= data "apstra_datacenter_ct_routing_policy" "vpn" {
      + name              = "Vendor_C"
      + primitive         = (known after apply)
      + routing_policy_id = (known after apply)
    }

  # module.vpn_routing.apstra_datacenter_connectivity_template.vpn will be created
  + resource "apstra_datacenter_connectivity_template" "vpn" {
      + blueprint_id = "2cd5f36b-cc9e-4665-9311-7b252f7deca3"
      + description  = "includes routing policies for [Vendor_A, Vendor_B, Vendor_C]"
      + id           = (known after apply)
      + name         = "IP+BGP handoff to VPN block"
      + primitives   = [
          + (known after apply),
        ]
      + tags         = [
          + "terraform",
          + "test",
        ]
    }

  # module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_A"] will be created
  + resource "apstra_datacenter_routing_policy" "vpn" {
      + blueprint_id        = "2cd5f36b-cc9e-4665-9311-7b252f7deca3"
      + description         = "Vendor_A: Import count: 1 Export count: 2"
      + expect_default_ipv4 = true
      + expect_default_ipv6 = true
      + export_policy       = {
          + export_l2_edge_subnets        = false
          + export_l3_edge_server_links   = false
          + export_loopbacks              = false
          + export_spine_leaf_links       = false
          + export_spine_superspine_links = false
          + export_static_routes          = false
        }
      + extra_exports       = [
          + {
              + action = "permit"
              + prefix = "10.5.16.0/24"
            },
          + {
              + action = "permit"
              + prefix = "10.5.18.0/24"
            },
        ]
      + extra_imports       = [
          + {
              + action = "permit"
              + prefix = "172.16.0.0/24"
            },
        ]
      + id                  = (known after apply)
      + import_policy       = "extra_only"
      + name                = "Vendor_A"
    }

  # module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_B"] will be created
  + resource "apstra_datacenter_routing_policy" "vpn" {
      + blueprint_id        = "2cd5f36b-cc9e-4665-9311-7b252f7deca3"
      + description         = "Vendor_B: Import count: 10 Export count: 1"
      + expect_default_ipv4 = true
      + expect_default_ipv6 = true
      + export_policy       = {
          + export_l2_edge_subnets        = false
          + export_l3_edge_server_links   = false
          + export_loopbacks              = false
          + export_spine_leaf_links       = false
          + export_spine_superspine_links = false
          + export_static_routes          = false
        }
      + extra_exports       = [
          + {
              + action = "permit"
              + prefix = "10.5.16.0/24"
            },
        ]
      + extra_imports       = [
          + {
              + action = "permit"
              + prefix = "172.17.0.0/24"
            },
          + {
              + action = "permit"
              + prefix = "172.17.2.0/24"
            },
          + {
              + action = "permit"
              + prefix = "172.17.4.0/24"
            },
          + {
              + action = "permit"
              + prefix = "172.17.6.0/24"
            },
          + {
              + action = "permit"
              + prefix = "172.17.8.0/24"
            },
          + {
              + action = "permit"
              + prefix = "172.17.10.0/24"
            },
          + {
              + action = "permit"
              + prefix = "172.17.12.0/24"
            },
          + {
              + action = "permit"
              + prefix = "172.17.14.0/24"
            },
          + {
              + action = "permit"
              + prefix = "172.17.17.0/24"
            },
          + {
              + action = "permit"
              + prefix = "172.17.18.0/24"
            },
        ]
      + id                  = (known after apply)
      + import_policy       = "extra_only"
      + name                = "Vendor_B"
    }

  # module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_C"] will be created
  + resource "apstra_datacenter_routing_policy" "vpn" {
      + blueprint_id        = "2cd5f36b-cc9e-4665-9311-7b252f7deca3"
      + description         = "Vendor_C: Import count: 3 Export count: 2"
      + expect_default_ipv4 = true
      + expect_default_ipv6 = true
      + export_policy       = {
          + export_l2_edge_subnets        = false
          + export_l3_edge_server_links   = false
          + export_loopbacks              = false
          + export_spine_leaf_links       = false
          + export_spine_superspine_links = false
          + export_static_routes          = false
        }
      + extra_exports       = [
          + {
              + action = "permit"
              + prefix = "10.5.16.0/24"
            },
          + {
              + action = "permit"
              + prefix = "10.5.20.0/22"
            },
        ]
      + extra_imports       = [
          + {
              + action = "permit"
              + prefix = "172.18.0.0/24"
            },
          + {
              + action = "permit"
              + prefix = "172.18.3.0/24"
            },
          + {
              + action = "permit"
              + prefix = "172.18.5.0/24"
            },
        ]
      + id                  = (known after apply)
      + import_policy       = "extra_only"
      + name                = "Vendor_C"
    }

Plan: 6 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

   ```
   